In [43]:
#programmer name : Parth Nirmal
#college : Keystone school of engg.
#class : TE(B)
#Roll no : 12

In [44]:
import pandas as pd
import numpy as np

In [45]:
num = np.array([12,30,40,50])
num

array([12, 30, 40, 50])

array([12, 30, 40, 50])

In [46]:
type(num)

numpy.ndarray

numpy.ndarray

In [47]:
num.dtype

dtype('int32')

dtype('int32')

In [48]:
num[2]

40

40

In [49]:
s = pd.Series([12,40,45,22])
s

0    12
1    40
2    45
3    22
dtype: int64

0    12
1    40
2    45
3    22
dtype: int64

In [50]:
type(s)

pandas.core.series.Series

pandas.core.series.Series

In [51]:
s.size

4

4

In [52]:
s.shape

(4,)

(4,)

In [53]:
s = pd.Series([12,40,45,22], index=range(100,104))
s

100    12
101    40
102    45
103    22
dtype: int64

100    12
101    40
102    45
103    22
dtype: int64

In [54]:
r = pd.Series([2,12,3])
n = pd.Series(["Parth","Pushkar","Rugved"])
m = pd.Series([12.4,24.5,37.8])

In [55]:
df = pd.DataFrame({
    "roll":r,
    "Name":n,
    "Marks":m
})

In [56]:
df

   roll     Name  Marks
0     2    Parth   12.4
1    12  Pushkar   24.5
2     3   Rugved   37.8

   roll     Name  Marks
0     2    Parth   12.4
1    12  Pushkar   24.5
2     3   Rugved   37.8

In [57]:
df.size

9

9

In [58]:
df.shape

(3, 3)

(3, 3)

In [59]:
df.dtypes

roll       int64
Name      object
Marks    float64
dtype: object

roll       int64
Name      object
Marks    float64
dtype: object

In [60]:
df = pd.read_csv('student.csv')

In [61]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [62]:
df1 = pd.read_csv("student1.csv")
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [63]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [65]:
df.ndim

2

2

In [66]:
import os
os.getcwd()

'C:\\Users\\shree\\Data Analytics'

'C:\\Users\\shree\\Data Analytics'